ZhuYanzhen1/MM32_CLion/program/MM32F3277.svd
        <register>
          <name>FGA0</name>
          <displayName>FGA0</displayName>
          <description>Filter Group Enable Register 0</description>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>FGA_7_0</name>
              <description>Filter group enable</description>
            </field>
          </fields>
        </register>
        <register>
          <name>FGA1</name>
          <displayName>FGA1</displayName>
          <description>Filter Group Enable Register 1</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>FGA_15_8</name>
              <description>Filter group enable</description>
            </field>
          </fields>
        </register>
        <register>
          <name>FGA2</name>
          <displayName>FGA2</displayName>
          <description>Filter Group Enable Register 2</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <name>FGA_19_16</name>
              <description>Filter group enable</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP1_ACR_B</name>
          <displayName>GROUP1_ACR_B</displayName>
          <description>Basic Acceptance Code register</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP1_ACR0_P</name>
          <displayName>GROUP1_ACR0_P</displayName>
          <description>Peli Acceptance Code register0</description>
          <alternateRegister>GROUP1_ACR_B</alternateRegister>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP1_ACR1_P</name>
          <displayName>GROUP1_ACR1_P</displayName>
          <description>Peli Acceptance Code register1</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP1_ACR2_P</name>
          <displayName>GROUP1_ACR2_P</displayName>
          <description>Peli Acceptance Code register2</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP1_ACR3_P</name>
          <displayName>GROUP1_ACR3_P</displayName>
          <description>Peli Acceptance Code register3</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP1_AMR_B</name>
          <displayName>GROUP1_AMR_B</displayName>
          <description>Basic Acceptance Mask register</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP1_AMR0_P</name>
          <displayName>GROUP1_AMR0_P</displayName>
          <description>Peli Acceptance Mask register 0</description>
          <alternateRegister>GROUP1_AMR_B</alternateRegister>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP1_AMR1_P</name>
          <displayName>GROUP1_AMR1_P</displayName>
          <description>Peli Acceptance Mask register 1</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP1_AMR2_P</name>
          <displayName>GROUP1_AMR2_P</displayName>
          <description>Peli Acceptance Mask register 2</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP1_AMR3_P</name>
          <displayName>GROUP1_AMR3_P</displayName>
          <description>Peli Acceptance Mask register 3</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP2_ACR_B</name>
          <displayName>GROUP2_ACR_B</displayName>
          <description>Basic Acceptance Code register</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP2_ACR0_P</name>
          <displayName>GROUP2_ACR0_P</displayName>
          <description>Peli Acceptance Code register</description>
          <alternateRegister>GROUP2_ACR_B</alternateRegister>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP2_ACR1_P</name>
          <displayName>GROUP2_ACR1_P</displayName>
          <description>Peli Acceptance Code register1</description>
          <addressOffset>0xBC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP2_ACR2_P</name>
          <displayName>GROUP2_ACR2_P</displayName>
          <description>Peli Acceptance Code register2</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP2_ACR3_P</name>
          <displayName>GROUP2_ACR3_P</displayName>
          <description>Peli Acceptance Code register3</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP2_AMR_B</name>
          <displayName>GROUP2_AMR_B</displayName>
          <description>Basic Acceptance Mask register</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP2_AMR0_P</name>
          <displayName>GROUP2_AMR0_P</displayName>
          <description>Peli Acceptance Mask register 0</description>
          <alternateRegister>GROUP2_AMR_B</alternateRegister>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP2_AMR1_P</name>
          <displayName>GROUP2_AMR1_P</displayName>
          <description>Peli Acceptance Mask register 1</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP2_AMR2_P</name>
          <displayName>GROUP2_AMR2_P</displayName>
          <description>Peli Acceptance Mask register 2</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP2_AMR3_P</name>
          <displayName>GROUP2_AMR3_P</displayName>
          <description>Peli Acceptance Mask register 3</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP3_ACR_B</name>
          <displayName>GROUP3_ACR_B</displayName>
          <description>Basic Acceptance Code register</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP3_ACR0_P</name>
          <displayName>GROUP3_ACR0_P</displayName>
          <description>Peli Acceptance Code register0</description>
          <alternateRegister>GROUP3_ACR_B</alternateRegister>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP3_ACR1_P</name>
          <displayName>GROUP3_ACR1_P</displayName>
          <description>Peli Acceptance Code register1</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP3_ACR2_P</name>
          <displayName>GROUP3_ACR2_P</displayName>
          <description>Peli Acceptance Code register2</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP3_ACR3_P</name>
          <displayName>GROUP3_ACR3_P</displayName>
          <description>Peli Acceptance Code register3</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP3_AMR_B</name>
          <displayName>GROUP3_AMR_B</displayName>
          <description>Basic Acceptance Mask register</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP3_AMR0_P</name>
          <displayName>GROUP3_AMR0_P</displayName>
          <description>Peli Acceptance Mask register 0</description>
          <alternateRegister>GROUP3_AMR_B</alternateRegister>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP3_AMR1_P</name>
          <displayName>GROUP3_AMR1_P</displayName>
          <description>Peli Acceptance Mask register 1</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP3_AMR2_P</name>
          <displayName>GROUP3_AMR2_P</displayName>
          <description>Peli Acceptance Mask register 2</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP3_AMR3_P</name>
          <displayName>GROUP3_AMR3_P</displayName>
          <description>Peli Acceptance Mask register 3</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AM</name>
              <description>Acceptance mask</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP4_ACR_B</name>
          <displayName>GROUP4_ACR_B</displayName>
          <description>Basic Acceptance Code register</description>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP4_ACR0_P</name>
          <displayName>GROUP4_ACR0_P</displayName>
          <description>Peli Acceptance Code register</description>
          <alternateRegister>GROUP4_ACR_B</alternateRegister>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP4_ACR1_P</name>
          <displayName>GROUP4_ACR1_P</displayName>
          <description>Peli Acceptance Code register1</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP4_ACR2_P</name>
          <displayName>GROUP4_ACR2_P</displayName>
          <description>Peli Acceptance Code register2</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
        <register>
          <name>GROUP4_ACR3_P</name>
          <displayName>GROUP4_ACR3_P</displayName>
          <description>Peli Acceptance Code register3</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>AC</name>
              <description>Acceptance code</description>
            </field>
          </fields>
        </register>
