ZhuYanzhen1/MM32_CLion/program/MM32F3277.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DBG</name>
      <description>Debug support</description>
      <groupName>DBG</groupName>
      <baseAddress>0x40007080</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IDCODE</name>
          <displayName>IDCODE</displayName>
          <description>Device ID code</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <name>DEV_ID</name>
              <description>Device identifier</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>Control Register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DBG_TIM7_STOP</name>
              <description>TIM7 counter stopped when core is halted</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_TIM6_STOP</name>
              <description>TIM6 counter stopped when core is halted</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_TIM5_STOP</name>
              <description>TIM5 counter stopped when core is halted</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_TIM8_STOP</name>
              <description>TIM8 counter stopped when core is halted</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_TIM4_STOP</name>
              <description>TIM4 counter stopped when core is halted</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_TIM3_STOP</name>
              <description>TIM3 counter stopped when core is halted</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_TIM2_STOP</name>
              <description>TIM2 counter stopped when core is halted</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_TIM1_STOP</name>
              <description>TIM1 counter stopped when core is halted</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_WWDG_STOP</name>
              <description>Debug window watchdog stopped when core is halted</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_IWDG_STOP</name>
              <description>Debug independent watchdog stopped when core is hatled</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_STOP_FOR_LDO</name>
              <description>Debug Stop mode for Ldo</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_STANDBY</name>
              <description>Debug Standby mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_STOP</name>
              <description>Debug Stop mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_SLEEP</name>
              <description>Debug Sleep mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DEVICE</name>
      <description>DEVICE</description>
      <groupName>DEVICE</groupName>
      <baseAddress>0x1FFFF7E8</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>UID1</name>
          <displayName>UID1</displayName>
          <description>Unique product indentification register 1</description>
          <addressOffset>0x00</addressOffset>
          <size>0x10</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>U_ID</name>
              <description>15:0 unique ID bits</description>
            </field>
          </fields>
        </register>
        <register>
          <name>UID2</name>
          <displayName>UID2</displayName>
          <description>Unique product indentification register 2</description>
          <addressOffset>0x02</addressOffset>
          <size>0x10</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>U_ID</name>
              <description>31:16 unique ID bits</description>
            </field>
          </fields>
        </register>
        <register>
          <name>UID3</name>
          <displayName>UID3</displayName>
          <description>Unique product indentification register 3</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <name>U_ID</name>
              <description>63:32 unique ID bits</description>
            </field>
          </fields>
        </register>
        <register>
          <name>UID4</name>
          <displayName>UID4</displayName>
          <description>Unique product indentification register 4</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <name>U_ID</name>
              <description>95:64 unique ID bits</description>
            </field>
          </fields>
        </register>
