ZhuYanzhen1/MM32_CLion/program/MM32F3277.svd
        <register>
          <name>DMAWDTR</name>
          <displayName>DMAWDTR</displayName>
          <description>Ethernet Watchdog register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <readAction>clear</readAction>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>RIWT</name>
              <description>*D0</description>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACUTTXDSAR</name>
          <displayName>DMACUTTXDSAR</displayName>
          <description>Ethernet DMA current host transmit descriptor register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <name>CUTTXDSA</name>
              <description>Host Receive Descriptor AddressPointer</description>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACUTTXBUFR</name>
          <displayName>DMACUTTXBUFR</displayName>
          <description>Ethernet DMA current host transmit buffer address register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <name>CUTTXBUF</name>
              <description>Host Transmit Buffer Address Pointer</description>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACUTRXBUFR</name>
          <displayName>DMACUTRXBUFR</displayName>
          <description>Ethernet DMA current host receive buffer address register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <name>CUTRXBUF</name>
              <description>Host Receive Buffer Address Pointer</description>
            </field>
          </fields>
        </register>
      </registers>
      <interrupt>
        <name>ETH</name>
        <description>Ethernet global interrupt</description>
        <value>61</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>Ethernet_MAC</name>
      <description>Ethernet: media access control (MAC)</description>
      <groupName>Ethernet</groupName>
      <baseAddress>0x40028000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>Ethernet MAC configuration register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0008000</resetValue>
          <fields>
            <field>
              <name>CST</name>
              <description>CRC stripping for Type frames</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WTD</name>
              <description>Watchdog Disable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JD</name>
              <description>Jabber Disable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IFG</name>
              <description>Inter Frame Gap</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MCRS</name>
              <description>Carrier sense disable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FES</name>
              <description>Fast Ethernet Speed</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROD</name>
              <description>Receive Own Disable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LM</name>
              <description>Loopback Mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DM</name>
              <description>Duplex Mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IPCO</name>
              <description>IPv4 Checksum Offload</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RETY</name>
              <description>Retry disable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APCS</name>
              <description>Automatic pad/CRC stripping</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BL</name>
              <description>Back-off limit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DLYC</name>
              <description>Deferral check</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TE</name>
              <description>Transmitter enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RE</name>
              <description>Receiver enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FFR</name>
          <displayName>FFR</displayName>
          <description>Ethernet MAC frame filter register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RALL</name>
              <description>Receive All</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DNTU</name>
              <description>The MAC receiver discards all IP packets without TCP or UDP fields</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VTFE</name>
              <description>VLAN Filter Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HPF</name>
              <description>Hash or Perfect Filter</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAF</name>
              <description>Source Address Filter</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAIF</name>
              <description>Source Address Inverse Filtering</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCF</name>
              <description>Pass Control Frames</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DBF</name>
              <description>Broadcast Frames Disable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PMF</name>
              <description>Pass All Multicast</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DAIF</name>
              <description>Destination address inverse filter-ing</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HM</name>
              <description>Hash Multicast</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HU</name>
              <description>Hash Unicast</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PM</name>
              <description>Promiscuous Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HTHR</name>
          <displayName>HTHR</displayName>
          <description>Ethernet MAC hash table high register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <name>HTABH</name>
              <description>Hash Table High</description>
            </field>
          </fields>
        </register>
        <register>
          <name>HTLR</name>
          <displayName>HTLR</displayName>
          <description>Ethernet MAC hash table low register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <name>HTABL</name>
              <description>Hash Table Low</description>
            </field>
          </fields>
        </register>
        <register>
          <name>MIIAR</name>
          <displayName>MIIAR</displayName>
          <description>Ethernet MAC MII address register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PA</name>
              <description>PHY Address</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <modifiedWriteValues>modify</modifiedWriteValues>
            </field>
            <field>
              <name>MR</name>
              <description>MII Register</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
              <modifiedWriteValues>modify</modifiedWriteValues>
            </field>
            <field>
              <name>CR</name>
              <description>Clock Range</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <modifiedWriteValues>modify</modifiedWriteValues>
            </field>
            <field>
              <name>MW</name>
              <description>MII Write</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>modify</modifiedWriteValues>
            </field>
            <field>
              <name>MB</name>
              <description>MII Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MIIDR</name>
          <displayName>MIIDR</displayName>
          <description>Ethernet MAC MII data register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>MD</name>
              <description>MII data</description>
            </field>
          </fields>
        </register>
        <register>
          <name>FCR</name>
          <displayName>FCR</displayName>
          <description>Ethernet MAC flow control register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PSET</name>
              <description>Pause time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>DZPQ</name>
              <description>When the flow control signal is valid, it is forbidden to generate a zero-slice pause control frame</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLT</name>
              <description>Pause Low Threshold</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>UP</name>
              <description>Unicast Pause Frame Detect</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRE</name>
              <description>Receive Flow Control Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTE</name>
              <description>Transmit Flow Control Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCBBPA</name>
              <description>Flow Control Busy/Back Pressure Activate</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VLANTR</name>
          <displayName>VLANTR</displayName>
          <description>Ethernet MAC VLAN tag register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>VLANTAG</name>
              <description>*D0</description>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>Ethernet MAC VLAN tag register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXFF</name>
              <description>The TxFIFO is full and can no longer receive frames sent</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFNE</name>
              <description>The TxFIFO is not empty, there are still unsent frames</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFWA</name>
              <description>The TxFIFO write controller is valid and is transferring data to the TxFIFO</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFRS</name>
              <description>Write the received Tx Status or refresh the TxFIFO</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MTP</name>
              <description>The MAC transmitter is in a paused state (when in full duplex mode), and no frame transmission is scheduled</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTS</name>
              <description>Transmit the input frame to be sent</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MTE</name>
              <description>The MAC MII transmission engine is actively sending data but not in an idle state</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFLL</name>
              <description>RX Fifo Full</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RXFRS</name>
              <description>Refresh frame data and status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RXFWA</name>
              <description>RxFIFO write is valid, and the received frame is being transferred to RxFIFO</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MRS</name>
              <description>The FIFO read/write controller in the MAC receiver is working</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MRE</name>
              <description>VLAN tag identifier (for receive frames)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACA0HR</name>
          <displayName>MACA0HR</displayName>
          <description>Ethernet MAC address 0 high register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDE</name>
              <description>Always 1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADDH</name>
              <description>MAC address0 high [47:32]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MACA0LR</name>
          <displayName>MACA0LR</displayName>
          <description>Ethernet MAC address 0 low register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <name>ADDL</name>
              <description>MAC address0 low [31:0]</description>
            </field>
          </fields>
        </register>
        <register>
          <name>MACA1HR</name>
          <displayName>MACA1HR</displayName>
          <description>Ethernet MAC address 1 high register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDE</name>
              <description>Address enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SELE</name>
              <description>Source address</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MBYTEC</name>
              <description>Mask Byte Control</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>ADDH</name>
              <description>MAC address1 high [47:32]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACA1LR</name>
          <displayName>MACA1LR</displayName>
          <description>Ethernet MAC address1 low register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <name>ADDL</name>
              <description>MAC address1 low [31:0]</description>
            </field>
          </fields>
        </register>
