ZhuYanzhen1/MM32_CLion/program/MM32F3277.svd
        <register>
          <name>MACA27HR</name>
          <displayName>MACA27HR</displayName>
          <description>Ethernet MAC address 15 high register</description>
          <addressOffset>0x858</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDE</name>
              <description>Address enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SELE</name>
              <description>Source address</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MBYTEC</name>
              <description>Mask Byte Control</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>ADDH</name>
              <description>MAC address15 high [47:32]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACA27LR</name>
          <displayName>MACA27LR</displayName>
          <description>Ethernet MAC address15 low register</description>
          <addressOffset>0x85C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <name>ADDL</name>
              <description>MAC address15 low [31:0]</description>
            </field>
          </fields>
        </register>
        <register>
          <name>MACA28HR</name>
          <displayName>MACA28HR</displayName>
          <description>Ethernet MAC address 15 high register</description>
          <addressOffset>0x860</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDE</name>
              <description>Address enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SELE</name>
              <description>Source address</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MBYTEC</name>
              <description>Mask Byte Control</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>ADDH</name>
              <description>MAC address15 high [47:32]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACA28LR</name>
          <displayName>MACA28LR</displayName>
          <description>Ethernet MAC address15 low register</description>
          <addressOffset>0x864</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <name>ADDL</name>
              <description>MAC address15 low [31:0]</description>
            </field>
          </fields>
        </register>
        <register>
          <name>MACA29HR</name>
          <displayName>MACA29HR</displayName>
          <description>Ethernet MAC address 15 high register</description>
          <addressOffset>0x868</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDE</name>
              <description>Address enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SELE</name>
              <description>Source address</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MBYTEC</name>
              <description>Mask Byte Control</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>ADDH</name>
              <description>MAC address15 high [47:32]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACA29LR</name>
          <displayName>MACA29LR</displayName>
          <description>Ethernet MAC address15 low register</description>
          <addressOffset>0x86C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <name>ADDL</name>
              <description>MAC address15 low [31:0]</description>
            </field>
          </fields>
        </register>
        <register>
          <name>MACA30HR</name>
          <displayName>MACA30HR</displayName>
          <description>Ethernet MAC address 15 high register</description>
          <addressOffset>0x870</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDE</name>
              <description>Address enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SELE</name>
              <description>Source address</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MBYTEC</name>
              <description>Mask Byte Control</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>ADDH</name>
              <description>MAC address15 high [47:32]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACA30LR</name>
          <displayName>MACA30LR</displayName>
          <description>Ethernet MAC address15 low register</description>
          <addressOffset>0x874</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <name>ADDL</name>
              <description>MAC address15 low [31:0]</description>
            </field>
          </fields>
        </register>
        <register>
          <name>MACA31HR</name>
          <displayName>MACA31HR</displayName>
          <description>Ethernet MAC address 15 high register</description>
          <addressOffset>0x878</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDE</name>
              <description>Address enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SELE</name>
              <description>Source address</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MBYTEC</name>
              <description>Mask Byte Control</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>ADDH</name>
              <description>MAC address15 high [47:32]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACA31LR</name>
          <displayName>MACA31LR</displayName>
          <description>Ethernet MAC address15 low register</description>
          <addressOffset>0x87C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <name>ADDL</name>
              <description>MAC address15 low [31:0]</description>
            </field>
          </fields>
        </register>
