ZhuYanzhen1/MM32_CLion/program/MM32F3277.svd
        <register>
          <name>FRM_NUML</name>
          <displayName>FRM_NUML</displayName>
          <description>Frame number register</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>FRM_7_0</name>
              <description>These bits represent the lower 8 bits of 11 bit frames</description>
            </field>
          </fields>
        </register>
        <register>
          <name>FRM_NUMH</name>
          <displayName>FRM_NUMH</displayName>
          <description>Frame number register</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <name>FRM_10_8</name>
              <description>These bits represent the higher 8 bits of 11 bit frames</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TOKEN</name>
          <displayName>TOKEN</displayName>
          <description>Token register</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>TOKEN_PID</name>
              <description>This 4_bit value is the token type executed by Vsub</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TOKEN_ENDPT</name>
              <description>This 4_bit value determines the endpoint address of the token command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SOF_THLD</name>
          <displayName>SOF_THLD</displayName>
          <description>SOF threshold register</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>CNT</name>
              <description>These bits represent the sof count threshold for byte time</description>
            </field>
          </fields>
        </register>
        <register>
          <name>BDT_PAGE_02</name>
          <displayName>BDT_PAGE_02</displayName>
          <description>BDT page register 2</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>BDT_BA_23_16</name>
              <description>The 8_bit value provides address bits 23 to 16 of the BDT base address, which defines the location of the buffer descriptor table in the system memory</description>
            </field>
          </fields>
        </register>
        <register>
          <name>BDT_PAGE_03</name>
          <displayName>BDT_PAGE_03</displayName>
          <description>BDT page register 3</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>BDT_BA_31_24</name>
              <description>The 8_bit value provides address bits 31 to 24 of the BDT base address, which defines the location of the buffer descriptor table in the system memory</description>
            </field>
          </fields>
        </register>
        <register>
          <name>EP_CTL0</name>
          <displayName>EP_CTL0</displayName>
          <description>Endpoint control register</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>HOST_WO_HUB_0</name>
              <description>This is a bit for master mode only and exists only in the control endpt0_rg register of endpoint 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RETRY_DIS_0</name>
              <description>This is a bit for master mode only and exists only in the control register of endpoint 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_CTL_DIS_0</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_RX_EN_0</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_TX_EN_0</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_STALL_0</name>
              <description>Any access to this endpoint will cause the otg_fs to return a stall handshake</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_HSHK_0</name>
              <description>Setting this bit defines whether the endpoint performs a handshake to the endpoint during the transaction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EP_CTL1</name>
          <displayName>EP_CTL1</displayName>
          <description>Endpoint control register</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>HOST_WO_HUB_1</name>
              <description>This is a bit for master mode only and exists only in the control endpt0_rg register of endpoint 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RETRY_DIS_1</name>
              <description>This is a bit for master mode only and exists only in the control register of endpoint 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_CTL_DIS_1</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_RX_EN_1</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_TX_EN_1</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_STALL_1</name>
              <description>Any access to this endpoint will cause the otg_fs to return a stall handshake</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_HSHK_1</name>
              <description>Setting this bit defines whether the endpoint performs a handshake to the endpoint during the transaction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EP_CTL2</name>
          <displayName>EP_CTL2</displayName>
          <description>Endpoint control register</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>HOST_WO_HUB_2</name>
              <description>This is a bit for master mode only and exists only in the control endpt0_rg register of endpoint 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RETRY_DIS_2</name>
              <description>This is a bit for master mode only and exists only in the control register of endpoint 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_CTL_DIS_2</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_RX_EN_2</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_TX_EN_2</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_STALL_2</name>
              <description>Any access to this endpoint will cause the otg_fs to return a stall handshake</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_HSHK_2</name>
              <description>Setting this bit defines whether the endpoint performs a handshake to the endpoint during the transaction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EP_CTL3</name>
          <displayName>EP_CTL3</displayName>
          <description>Endpoint control register</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>HOST_WO_HUB_3</name>
              <description>This is a bit for master mode only and exists only in the control endpt0_rg register of endpoint 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RETRY_DIS_3</name>
              <description>This is a bit for master mode only and exists only in the control register of endpoint 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_CTL_DIS_3</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_RX_EN_3</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_TX_EN_3</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_STALL_3</name>
              <description>Any access to this endpoint will cause the otg_fs to return a stall handshake</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_HSHK_3</name>
              <description>Setting this bit defines whether the endpoint performs a handshake to the endpoint during the transaction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EP_CTL4</name>
          <displayName>EP_CTL4</displayName>
          <description>Endpoint control register</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>HOST_WO_HUB_4</name>
              <description>This is a bit for master mode only and exists only in the control endpt0_rg register of endpoint 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RETRY_DIS_4</name>
              <description>This is a bit for master mode only and exists only in the control register of endpoint 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_CTL_DIS_4</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_RX_EN_4</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_TX_EN_4</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_STALL_4</name>
              <description>Any access to this endpoint will cause the otg_fs to return a stall handshake</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_HSHK_4</name>
              <description>Setting this bit defines whether the endpoint performs a handshake to the endpoint during the transaction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EP_CTL5</name>
          <displayName>EP_CTL5</displayName>
          <description>Endpoint control register</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>HOST_WO_HUB_5</name>
              <description>This is a bit for master mode only and exists only in the control endpt0_rg register of endpoint 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RETRY_DIS_5</name>
              <description>This is a bit for master mode only and exists only in the control register of endpoint 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_CTL_DIS_5</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_RX_EN_5</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_TX_EN_5</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_STALL_5</name>
              <description>Any access to this endpoint will cause the otg_fs to return a stall handshake</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_HSHK_5</name>
              <description>Setting this bit defines whether the endpoint performs a handshake to the endpoint during the transaction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EP_CTL6</name>
          <displayName>EP_CTL6</displayName>
          <description>Endpoint control register</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>HOST_WO_HUB_6</name>
              <description>This is a bit for master mode only and exists only in the control endpt0_rg register of endpoint 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RETRY_DIS_6</name>
              <description>This is a bit for master mode only and exists only in the control register of endpoint 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_CTL_DIS_6</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_RX_EN_6</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_TX_EN_6</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_STALL_6</name>
              <description>Any access to this endpoint will cause the otg_fs to return a stall handshake</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_HSHK_6</name>
              <description>Setting this bit defines whether the endpoint performs a handshake to the endpoint during the transaction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EP_CTL7</name>
          <displayName>EP_CTL7</displayName>
          <description>Endpoint control register</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>HOST_WO_HUB_7</name>
              <description>This is a bit for master mode only and exists only in the control endpt0_rg register of endpoint 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RETRY_DIS_7</name>
              <description>This is a bit for master mode only and exists only in the control register of endpoint 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_CTL_DIS_7</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_RX_EN_7</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_TX_EN_7</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_STALL_7</name>
              <description>Any access to this endpoint will cause the otg_fs to return a stall handshake</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_HSHK_7</name>
              <description>Setting this bit defines whether the endpoint performs a handshake to the endpoint during the transaction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
