ZhuYanzhen1/MM32_CLion/program/MM32F3277.svd
        <register>
          <name>EP_CTL8</name>
          <displayName>EP_CTL8</displayName>
          <description>Endpoint control register</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>HOST_WO_HUB_8</name>
              <description>This is a bit for master mode only and exists only in the control endpt0_rg register of endpoint 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RETRY_DIS_8</name>
              <description>This is a bit for master mode only and exists only in the control register of endpoint 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_CTL_DIS_8</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_RX_EN_8</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_TX_EN_8</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_STALL_8</name>
              <description>Any access to this endpoint will cause the otg_fs to return a stall handshake</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_HSHK_8</name>
              <description>Setting this bit defines whether the endpoint performs a handshake to the endpoint during the transaction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EP_CTL9</name>
          <displayName>EP_CTL9</displayName>
          <description>Endpoint control register</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>HOST_WO_HUB_9</name>
              <description>This is a bit for master mode only and exists only in the control endpt0_rg register of endpoint 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RETRY_DIS_9</name>
              <description>This is a bit for master mode only and exists only in the control register of endpoint 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_CTL_DIS_9</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_RX_EN_9</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_TX_EN_9</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_STALL_9</name>
              <description>Any access to this endpoint will cause the otg_fs to return a stall handshake</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_HSHK_9</name>
              <description>Setting this bit defines whether the endpoint performs a handshake to the endpoint during the transaction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EP_CTL10</name>
          <displayName>EP_CTL10</displayName>
          <description>Endpoint control register</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>HOST_WO_HUB_10</name>
              <description>This is a bit for master mode only and exists only in the control endpt0_rg register of endpoint 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RETRY_DIS_10</name>
              <description>This is a bit for master mode only and exists only in the control register of endpoint 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_CTL_DIS_10</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_RX_EN_10</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_TX_EN_10</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_STALL_10</name>
              <description>Any access to this endpoint will cause the otg_fs to return a stall handshake</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_HSHK_10</name>
              <description>Setting this bit defines whether the endpoint performs a handshake to the endpoint during the transaction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EP_CTL11</name>
          <displayName>EP_CTL11</displayName>
          <description>Endpoint control register</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>HOST_WO_HUB_11</name>
              <description>This is a bit for master mode only and exists only in the control endpt0_rg register of endpoint 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RETRY_DIS_11</name>
              <description>This is a bit for master mode only and exists only in the control register of endpoint 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_CTL_DIS_11</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_RX_EN_11</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_TX_EN_11</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_STALL_11</name>
              <description>Any access to this endpoint will cause the otg_fs to return a stall handshake</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_HSHK_11</name>
              <description>Setting this bit defines whether the endpoint performs a handshake to the endpoint during the transaction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EP_CTL12</name>
          <displayName>EP_CTL12</displayName>
          <description>Endpoint control register</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>HOST_WO_HUB_12</name>
              <description>This is a bit for master mode only and exists only in the control endpt0_rg register of endpoint 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RETRY_DIS_12</name>
              <description>This is a bit for master mode only and exists only in the control register of endpoint 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_CTL_DIS_12</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_RX_EN_12</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_TX_EN_12</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_STALL_12</name>
              <description>Any access to this endpoint will cause the otg_fs to return a stall handshake</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_HSHK_12</name>
              <description>Setting this bit defines whether the endpoint performs a handshake to the endpoint during the transaction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EP_CTL13</name>
          <displayName>EP_CTL13</displayName>
          <description>Endpoint control register</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>HOST_WO_HUB_13</name>
              <description>This is a bit for master mode only and exists only in the control endpt0_rg register of endpoint 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RETRY_DIS_13</name>
              <description>This is a bit for master mode only and exists only in the control register of endpoint 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_CTL_DIS_13</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_RX_EN_13</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_TX_EN_13</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_STALL_13</name>
              <description>Any access to this endpoint will cause the otg_fs to return a stall handshake</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_HSHK_13</name>
              <description>Setting this bit defines whether the endpoint performs a handshake to the endpoint during the transaction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EP_CTL14</name>
          <displayName>EP_CTL14</displayName>
          <description>Endpoint control register</description>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>HOST_WO_HUB_14</name>
              <description>This is a bit for master mode only and exists only in the control endpt0_rg register of endpoint 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RETRY_DIS_14</name>
              <description>This is a bit for master mode only and exists only in the control register of endpoint 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_CTL_DIS_14</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_RX_EN_14</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_TX_EN_14</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_STALL_14</name>
              <description>Any access to this endpoint will cause the otg_fs to return a stall handshake</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_HSHK_14</name>
              <description>Setting this bit defines whether the endpoint performs a handshake to the endpoint during the transaction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EP_CTL15</name>
          <displayName>EP_CTL15</displayName>
          <description>Endpoint control register</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>HOST_WO_HUB_15</name>
              <description>This is a bit for master mode only and exists only in the control endpt0_rg register of endpoint 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RETRY_DIS_15</name>
              <description>This is a bit for master mode only and exists only in the control register of endpoint 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_CTL_DIS_15</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_RX_EN_15</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_TX_EN_15</name>
              <description>These three bits define whether the endpoint is enabled and the direction of the endpoint</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_STALL_15</name>
              <description>Any access to this endpoint will cause the otg_fs to return a stall handshake</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP_HSHK_15</name>
              <description>Setting this bit defines whether the endpoint performs a handshake to the endpoint during the transaction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
