ZhuYanzhen1/MM32_CLion/program/MM32F3277.svd
        <register>
          <name>CMD_BUF1</name>
          <displayName>CMD_BUF1</displayName>
          <description>CMD buffer register 1</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DAT</name>
              <description>cmd_buf byte 1, mapped to command bit 23 to bit 16 bits</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_BUF2</name>
          <displayName>CMD_BUF2</displayName>
          <description>CMD buffer register 2</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DAT</name>
              <description>cmd_buf byte 2, mapped to command bit 31 to bit 24 bits</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_BUF3</name>
          <displayName>CMD_BUF3</displayName>
          <description>CMD buffer register 3</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DAT</name>
              <description>cmd_buf byte 3, mapped to command bit 39 to bit 32 bits</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_BUF4</name>
          <displayName>CMD_BUF4</displayName>
          <description>CMD buffer register 4</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DAT</name>
              <description>cmd_buf byte 4, mapped to command bit 47 to bit 40 bits</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_BUF5</name>
          <displayName>CMD_BUF5</displayName>
          <description>CMD buffer register 5</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DAT</name>
              <description>cmd_buf byte 5, mapped to command bit 55 to bit 48 bits</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_BUF6</name>
          <displayName>CMD_BUF6</displayName>
          <description>CMD buffer register 6</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DAT</name>
              <description>cmd_buf byte 6, mapped to command bit 63 to bit 56 bits</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_BUF7</name>
          <displayName>CMD_BUF7</displayName>
          <description>CMD buffer register 7</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DAT</name>
              <description>cmd_buf byte 7, mapped to command bit 71 to bit 64 bits</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_BUF8</name>
          <displayName>CMD_BUF8</displayName>
          <description>CMD buffer register 8</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DAT</name>
              <description>cmd_buf byte 8, mapped to command bit 79 to bit 72 bits</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_BUF9</name>
          <displayName>CMD_BUF9</displayName>
          <description>CMD buffer register 9</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DAT</name>
              <description>cmd_buf byte 9, mapped to command bit 87 to bit 80 bits</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_BUF10</name>
          <displayName>CMD_BUF10</displayName>
          <description>CMD buffer register 10</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DAT</name>
              <description>cmd_buf byte 10, mapped to command bit 95 to bit 88 bits</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_BUF11</name>
          <displayName>CMD_BUF11</displayName>
          <description>CMD buffer register 11</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DAT</name>
              <description>cmd_buf byte 11, mapped to command bit 103 to bit 96 bits</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_BUF12</name>
          <displayName>CMD_BUF12</displayName>
          <description>CMD buffer register 12</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DAT</name>
              <description>cmd_buf byte 12, mapped to the command bit 111 to bit 104 bit</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_BUF13</name>
          <displayName>CMD_BUF13</displayName>
          <description>CMD buffer register 13</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DAT</name>
              <description>cmd_buf byte 13, mapped to the command bit 119 to bit 112 bit</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_BUF14</name>
          <displayName>CMD_BUF14</displayName>
          <description>CMD buffer register 14</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DAT</name>
              <description>cmd_buf byte 14, mapped to command bit 127 to bit 120 bits</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_BUF15</name>
          <displayName>CMD_BUF15</displayName>
          <description>CMD buffer register 15</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>DAT</name>
              <description>cmd_buf byte 15, mapped to command bit 135 to bit 128 bits</description>
            </field>
          </fields>
        </register>
        <register>
          <name>BUFCR</name>
          <displayName>BUFCR</displayName>
          <description>Buffer control register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>DBFEN</name>
              <description>Data Buf flush enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMARM</name>
              <description>DMA Requst mask</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFIFOSM</name>
              <description>Data FIFO status signal mask bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BADIR</name>
              <description>Set buff access direction</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAHEN</name>
              <description>DMA hardware interface enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBML</name>
              <description>Data buff data water mark level</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DBE</name>
              <description>Data buff empty. read-only</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBF</name>
              <description>Data buff full</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DAT_BUF</name>
          <displayName>DAT_BUF</displayName>
          <description>Data buffer register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <name>DAT</name>
              <description>Data buffer</description>
            </field>
          </fields>
        </register>
