ZhuYanzhen1/MM32_CLion/program/MM32F3277.svd
        <register>
          <name>SCR</name>
          <displayName>SCR</displayName>
          <description>ISO7816 configure register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>HDSEL</name>
              <description>Single-wire half-duplex mode selection bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCFCNT</name>
              <description>ISO7816 protection counter bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NACK</name>
              <description>Master receive frame answer bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SCAEN</name>
              <description>ISO7816 check auto-response bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCEN</name>
              <description>ISO7816 enable control bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDLR</name>
          <displayName>IDLR</displayName>
          <description>Data length register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000C</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>IDLR</name>
              <description>Idle data length register</description>
            </field>
          </fields>
        </register>
        <register>
          <name>ABRCR</name>
          <displayName>ABRCR</displayName>
          <description>Automatic Baud Rate Register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>Later_edge</name>
              <description>Automatic baud rate after edge selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>Former_edge</name>
              <description>Auto baud rate previous edge selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>Abr_bitcnt</name>
              <description>Automatic baud rate detection length</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>Abren</name>
              <description>Automatic baud rate enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IRDA</name>
          <displayName>IRDA</displayName>
          <description>IrDA configure register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0100</resetValue>
          <fields>
            <field>
              <name>PSC_REG</name>
              <description>*D4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SIRLP</name>
              <description>IrDA low-power</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SIREN</name>
              <description>IrDA mode enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
      <interrupt>
        <name>UART1</name>
        <description>UART1 global interrupt</description>
        <value>37</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="UART1">
      <name>UART2</name>
      <baseAddress>0x40004400</baseAddress>
      <interrupt>
        <name>UART2</name>
        <description>UART2 global interrupt</description>
        <value>38</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="UART1">
      <name>UART3</name>
      <baseAddress>0x40004800</baseAddress>
      <interrupt>
        <name>UART3</name>
        <description>UART3 global interrupt</description>
        <value>39</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="UART1">
      <name>UART4</name>
      <baseAddress>0x40004C00</baseAddress>
      <interrupt>
        <name>UART4</name>
        <description>UART4 global interrupt</description>
        <value>52</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="UART1">
      <name>UART5</name>
      <baseAddress>0x40005000</baseAddress>
      <interrupt>
        <name>UART5</name>
        <description>UART5 global interrupt</description>
        <value>53</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="UART1">
      <name>UART6</name>
      <baseAddress>0x40013C00</baseAddress>
      <interrupt>
        <name>UART6</name>
        <description>UART6 global interrupt</description>
        <value>71</value>
      </interrupt>
    </peripheral>
